# -*- mode: org; mode: flyspell; ispell-local-dictionary: "hu" -*-
#+TITLE: Prolog

18+14 alkalom
* Áttekintés
| Anyagrérsz           | Órák | Hét |
|----------------------+------+-----|
| Bevezetés            |    4 |     |
| Logikai formalizáció |    5 |     |
| Logika               |   12 |     |
| *Dolgozat 1*         |    3 |  12 |
|----------------------+------+-----|
| Prolog               |    6 |     |
| IO                   |    4 |     |
| Listák               |   12 |     |
| Fák                  |    6 |     |
| Vágás                |    3 |     |
| *Dolgozat 2*         |    3 |  17 |
|----------------------+------+-----|
| Nyelvek              |    5 |     |
| *Oszályzás           |    1 |     |
|----------------------+------+-----|
|                      |   32 | Hét |
#+TBLFM: @5$3=vsum(@-I$2..@0$2)/2::@11$3=vsum(@-I$2..@0$2)/2::@14$2=vsum(@2..@-1)/2
* Bevezetés 1-2
** Prolog bevezető 
** Logika bevezető (ciklus és/vagy értékadás mentes programozás)
*** Programozási nyelvek és nyelvek 
*** Hello World prolog 
* Logika
** Nyelvek, elsőrendű logika, műveletek
** Rezolúció, Kanonikus formák
** Másodrendű logika 
** Változók hatásköre és kötöttsége, formulák nyitottsága
** Matematikai modellek, gyakorlás
** Ellenőrző

* Prolog
** Alapfogalmak
** Egyesítés, bizonyítás keresés
** Gyakorlás 
** Ellenőrző

* Blokkok
** Ciklus és értékadás mentes programok

* TRASH
** Bizonyítási módszerek
** Tautológiák
* Ötletek
** Halmazelmélet 
